// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('введіть число від 0 до 59');
//  if (time >=0 && time<= 15) {
//      console.log('перша чверть');
//  }else if (time >=15 && time <=29){
//      console.log('друга чверть')
//  }else if (time >=30 && time <=44){
//      console.log('третя чверть')
//  }else if (time >=45 && time <=59){
//      console.log('четверта  чверть')
//  }else {
//      console.log('некоректно введені дані')
//  }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('введіть число від 1 до 31')
// if (day >= 0 && day <=10){
//     console.log("перша декада місяця")
// }else if (day >= 11 && day <=20) {
//     console.log("друга декада місяця")
// }else if (day >= 21 && day <=31) {
//     console.log("третя декада місяця")
// }else{
//     console.log('некоректно введені дані')
// }


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = prompt('введіть значення')
// if (!!test){
//     console.log('вірно')
// }else {
//     console.log('nevirno')
// }
//  let test = prompt('введіть значення') ? 'вірно' : 'неправильно'
//  console.log(test)
//  let test = !!prompt('введіть значення');
// console.log(test)


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = +prompt('введіть число')
// if (a !== 0){
//     console.log('вірно')
// }else {
//     console.log('невірно')
// }


// Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let dayOfWeek = +prompt('Введіть день тижня від 1 до 7');
// switch (dayOfWeek){
//     case 1:
//     console.log('Понеділок: піти в зал');
//         break;
//     case 2:
//         console.log('Вівторок: піти до зубного');
//         break;
//     case 3:
//         console.log('Середа прочитати книгу');
//         break;
//     case 4:
//         console.log('Четвер: вигуляти собаку');
//         break;
//     case 5:
//         console.log('Пятниця:відвідати бабуся');
//         break;
//     case 6:
//         console.log('Субота:підготуватися до відпочинку');
//         break;
//     case 7:
//         console.log('Неділля: відпочинок');
//         break;
//     default:
//         console.log('Введене не коректо')
//     }


// // - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = +prompt('Введіть кількість днів в році')
// if (year % 4 === 0){
//     console.log('Рік високосний')
// }else {
//     console.log('Рік не високосний')
// }
// let yer =(+prompt('введіть кількість днів в році') % 4 === 0) ? console.log('Рік високосний') : console.log('Рік не високосний');


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let a = prompt('Яка «офіційна» назва JavaScript?');
// if(a === 'ECMAScript'){
//     console.log('Правильно')
// }else{
//     console.log('Не знаєте? ECMAScript!')
// }