// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let dataFriends = friends.length
// if (dataFriends >= 3){
// document.write('Це великий масив ,в якому 3 і більше елементи')
// }else {
//     document.write('Це маленький масив ,в якому менше 3-х улементів')
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let a = [8, 5, 3,];
// if ((a[1] > a[0] && a[1] < a[2]) ||(a[1] < a[0] && a[1] > a[2])){
//     document.write(`${a[1]} середнє число`)
// }else if ((a[0] > a[1] && a[0] < a[2]) ||(a[0] < a[1] && a[0] > a[2])){
//     document.write(`${a[0]} середнє число`)
// }else if ((a[2] > a[0] && a[2] < a[1]) ||(a[2] < a[0] && a[2] > a[1])){
//     document.write(`${a[2]} середнє число`)
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let a =2;
// let b = 2;
// let result =(a + b < 4) ? document.write('Мало') : document.write('Багато');


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let a = Math.round(Math.random()*200) -100;
// if (a < 0){
//     console.log('негативне число');
// }else if (a > 0){
//     console.log('позитивне')
// }else if (a === 0){
//     console.log('нуль')
// }
// console.log(a)
