// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let namber1 = +prompt('Введіть перше число')
// let namber2 = +prompt('Введіть друге число')
// if(namber1 > namber2){
//     console.log(namber1)
// }else if(namber1 === namber2){
//     console.log('Введені числа рівні')
// }else if(namber1 < namber2) {
//     console.log(namber2)
// }else{
//     console.log('некоректні дані')
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let apartmentNumbers = +prompt("Введіть номер квартири");
// if(apartmentNumbers >=0 && apartmentNumbers <=20){
//     console.log('Перший підїзд')
// }else if(apartmentNumbers >=21 && apartmentNumbers <=48){
//     console.log('Другий  підїзд')
//     }else if(apartmentNumbers >=49 && apartmentNumbers <=90) {
//     console.log('Третій підїзд')
// }else{
//     console.log('Некоректні дані')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number =(+prompt('Введіть число') === 10) ? document.write('<h1>\Вірно</h1>') : document.write('<h1>Невірно</h1>')


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
// let writeData = 5;
// writeData = 7<4
// if (typeof writeData === 'number') {
//     document.write('це число')
// } else if (typeof writeData === "string") {
//     document.write('це текст')
// } else if (typeof writeData === "object") {
//     document.write('це обєкт')
// } else if (typeof writeData === "boolean") {
//     document.write('це булеве значення')
// } else {
//     document.write('Взагалі не зрозуміло що ви ввели')
// }
//


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let t = +prompt('Яка температура  ??');
// if(t >= 10 && t <= 22){
//     console.log('Йдем вчитися')
// }else {
//     console.log('сидимо в дома')
// }




// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    // числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let game = +prompt( 'введіть число від 1 до 5');
// switch (game) {
//     case 1:
//         document.write('Автомобіль');
//         break;
//     case 2:
//         document.write('Квартира');
//         break;
//     case 3:
//         document.write('Мотоцикл');
//         break;
//     case 4:
//         document.write('Телефон');
//         break;
//     case 5:
//         document.write('ноутбук');
//         break;
//     default:
//         document.write('число не вірне')
//
// }